<template>
  <div class='md-body'>
    <h1>История релизов.</h1>
    <div>
      <h2>🍏 Release v1.3</h2>
      <h3>Ревью после проверки ДЗ:</h3>
      <ul>
        <li>Настроен .editorconfig и eslint в WebStorm</li>
        <li>Файлы не переименовывал по стандарту arbnb</li>
        <li>В Readme добавил идеальный вариант работы 404 редиректа от преподавателя</li>
        <li>Публикую итоговый вариант на GitHub Pages</li>
      </ul>
    </div>
    <div>
      <h2>🎈 Release v1.2</h2>
      <h3>Выполнены домашние задания:</h3>
      <ul>
        <li>
          Простое - вынести в отдельный UI компонент характеристики персонажа
        </li>
        <li>
          Сложное - настроить редирект на страницу 404 при переходе на
          несуществующую страницу
        </li>
        <li>Добавил иконку на гит репозиторий, чтоб было</li>
      </ul>
      <br />
    </div>
    <div>
      <h2>🐬 Release v1.0</h2>
      <h3>
        Сделано на курсе самостоятельно после просмотров уроков или реже
        параллельно с преподавателем:
      </h3>
      <ul>
        <li>Vue-Router в связке Vue.js 3</li>
        <li>Динамические маршруты</li>
        <li>Установка своих тем поврех своего шаблона vue cli</li>
        <li>
          Понимание того, как работают темы для фреймворков по типу Material UI
        </li>
        <li>Критерии выбора библиотеки</li>
        <li>
          Разбор библиотек и взгляд "изнутри". Полное понимание того, как
          пишутся библиотеки
        </li>
        <li>Слайдер с персонажами</li>
      </ul>
    </div>
    <p>
      Сделано на курсе
      <a
        style='color: #ffffff'
        href='https://tocode.ru/courses/vuejs-3-s-nulya-do-rezultata/?r=l0j'
      >Vue.js 3 С нуля до результата</a>
    </p>
  </div>
</template>
